UNFCOPY.саУНФУправлениеАссортиментом/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8fa5dae7-0bd0-4362-b9f3-80866a2bb0b1">
  <name>РасчетыСПокупателями</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="b121c25c-ddaa-4835-a1cd-51cfddb51170">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="53b829b6-de94-4b7b-8f6b-84e3b628f028">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b6b4b04e-11e1-4863-abd0-935b3b246198">
  <name>ВидыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cbb74a99-a3de-4a04-b39c-0c5fdfc6a1b0">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1df639b-d0d6-4c5a-be9f-fe40514bb507">
    <name>ЮридическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="473e170d-f298-4de8-aa08-bb00f5100100">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="443de79e-3c1d-4498-b53e-77ce4b2a5167">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UNFCOPY.саУНФУправлениеАссортиментом/src/AccumulationRegisters/РасчетыСПокупателями/RecordSetModule.bsl
&После("ПередЗаписью")
Процедура саУНФ_ПередЗаписью(Отказ, Замещение)
	УстановитьПривилегированныйРежим(Истина);

	УзелЮрЛ =  ПланыОбмена.ОбменКонтрагенты.НайтиПоКоду("2");
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Источник = ТекЗапись.Контрагент;
		
		Если  НЕ Источник.Покупатель ИЛИ  Источник.ПометкаУдаления ИЛИ Источник.Недействителен ИЛИ НЕ ЗначениеЗаполнено(Источник.СтранаРегистрации) 
			ИЛИ НЕ Источник.Проверен  ИЛИ  НЕ ВРЕГ(Источник.СтранаРегистрации.Наименование) = "БЕЛАРУСЬ"
			Тогда  
			Продолжить; 
		КонецЕсли;
		
		
		
		
		Если Источник.ВидКонтрагента=Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель
			Или  Источник.ВидКонтрагента=Перечисления.ВидыКонтрагентов.ЮридическоеЛицо
			Тогда
			Если НЕ ЗначениеЗаполнено(Источник.ИНН) ИЛИ НЕ СтрДлина(Источник.ИНН)=9 
				ИЛИ НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Источник.ИНН) Тогда
				Продолжить;
			КонецЕсли; 
			
			
			Если  НЕ ПланыОбмена.ИзменениеЗарегистрировано(УзелЮрЛ,Источник) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелЮрЛ,Источник);		
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;	
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры
